// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.

// 3, 5 -> 243 (3⁵)

// 2, 4 -> 16

//====================================================================================================================

//Решение:

// Console.WriteLine("Какое число вы хотите возвести в степень?");
// int A = int.Parse(Console.ReadLine()!);

// Console.WriteLine("В какую степень возвести число?");
// int B = int.Parse(Console.ReadLine()!);

// Console.WriteLine($"Ответ: {Exponentiation(A, B)}");

// int Exponentiation(int num1, int num2){
//     int res = num1;
//     for (int i = 1; i < num2; i++){
//         res *= num1;
//     }
//     return res;
// }

//====================================================================================================================