// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

// 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]
// 6, 1, 33 -> [6, 1, 33]

//====================================================================================================================

//Решение:

// int num = 8;
// int[] array = ArrayNum(num);
// Console.WriteLine($"[{String.Join(", ", array)}]");

// int[] ArrayNum(int elements){
//     int[] res = new int[elements];
//     for (int i = 0; i < elements; i++)
//     {
//         res[i] = new Random().Next(101);
//     }
//     return res;
// }

//====================================================================================================================